In [51]:
import pandas as pd

In [52]:
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

In [64]:
employees['bonus'] = employees.loc[employees['employee_id']%2!=0 & ~(employees['name'].str.startswith('M'))]['salary'] * 1
employees

   employee_id     name  salary   bonus
0            2     Meir     NaN     NaN
1            3  Michael  3800.0  3800.0
2            7  Addilyn  7400.0  7400.0
3            8     Juan     NaN     NaN
4            9   Kannon  7700.0  7700.0

In [54]:
# employees.loc[employees['employee_id']%2!=0 & employees['name'].str.startswith('M')]
employees.query("employee_id%2!=0 & ~name.str.startswith('M')")

   employee_id     name  salary
1            3  Michael  3800.0
2            7  Addilyn  7400.0
4            9   Kannon  7700.0